from datetime import datetime
# 这里是存储一些事先要准备数据的地方
# 用户名和密码
username = 'yinbh20'
password = 'ybh261426160628'

# 打卡需要填写内容，因为每天都需要重填
major = '电子信息'  # 专业名称
grade = '2020'  # 年级
school_district = '中心校区' # 所属校区
department = '文苑6公寓' # 公寓名称
room_number = '415' # 寝室号

# 表单年级候选，这个可能会根据页面改动而改动
grade_optional = [i for i in range(2010, datetime.now().year + 1)]
# 校区表单候选
district_optional = [
    '中心校区',
    '南岭校区',
    '新民校区',
    '南湖校区',
    '和平校区',
    '朝阳校区',
    '前卫北区',
]
# 公寓候选
department_optional = [
    ['北苑1公寓', '北苑2公寓', '南苑1公寓', '南苑2公寓', '南苑3公寓', '南苑4公寓', '南苑5公寓A区', '南苑5公寓B区',
     '南苑5公寓C区', '南苑6公寓', '南苑7公寓', '南苑8公寓', '南苑9公寓', '大学城1公寓', '大学城2公寓', '大学城3公寓',
     '文苑1公寓', '文苑2公寓', '文苑3公寓', '文苑4公寓', '文苑5公寓', '文苑6公寓', '文苑7公寓', '文苑8公寓', '文苑9公寓'],
    ['南岭1公寓', '南岭2公寓', '南岭3公寓', '南岭4公寓', '南岭5公寓', '南岭6公寓', '南岭7公寓', '南岭8公寓', '南岭9公寓', '南岭10公寓',
     '南岭11公寓', '南岭12公寓A区', '南岭12公寓B区', '南岭12公寓C区', '南岭13公寓', '南岭14公寓'],
    [f'新民{i}公寓' for i in range(1, 12)],
    [f'南湖{i}公寓' for i in range(1, 7)],
    [f'和平{i}公寓' for i in range(1, 9)],
    [f'朝阳{i}公寓' for i in range(1, 8)],
    [f'北区{i}公寓' for i in range(1, 9)],
]
